# FilterStringRule Properties

---
The FilterStringRule type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule)
| RuleString|  The user-supplied string against which strings from a Revit document will be tested.
Top
#### Reference
FilterStringRule Class
Autodesk.Revit.DB Namespace